---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsDbgShowLandingPath
source: html/1edfbdf5-a75b-8a9f-2700-83437010a74a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsDbgShowLandingPath Property

"Show Landing Path"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsDbgShowLandingPath { get; }
```